"""
Задача 32: Определить индексы элементов массива (списка),
значения которых принадлежат заданному диапазону (т.е. не
меньше заданного минимума и не больше заданного
максимума)

Ввод: [-5, 9, 0, 3, -1, -2, 1,
4, -2, 10, 2, 0, -9, 8, 10, -9,
0, -5, -5, 7]

Вывод: [1, 9, 13, 14, 19]

"""

lst = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
min_el = 6
max_el = 11
lst1 = []

for i in range(len(lst)):
    if lst[i] > min_el and lst[i] < max_el:
       lst1.append(i)

print(lst1)

